#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Ошибки Экспорт;

#КонецОбласти 

#Область ПрограммныйИнтерфейс

Процедура Добавить(Поле, Тип, Сообщение, Значение, ДополнительноеЗначение = Неопределено) Экспорт

	Ошибка = Новый Структура;
	Ошибка.Вставить("Поле", Поле);
	Ошибка.Вставить("Тип", Тип);
	Ошибка.Вставить("Сообщение", Сообщение);
	Ошибка.Вставить("Значение", Значение);
	Ошибка.Вставить("ДополнительноеЗначение", ДополнительноеЗначение); 
	Ошибки.Добавить(Ошибка); 
	
КонецПроцедуры

Процедура Очистить() Экспорт
	
	Ошибки = Новый Массив;
	
КонецПроцедуры

Функция Количество() Экспорт
	
	Возврат Ошибки.Количество();
	
КонецФункции

Функция ВСтроку(Разделитель = Неопределено) Экспорт
		
	Если Разделитель = Неопределено Тогда
		Разделитель = Символы.ПС;
	КонецЕсли;
	
	Строки = Новый Массив;
	Для Каждого Ошибка Из Ошибки Цикл
		Строки.Добавить(Ошибка.Сообщение); 	
	КонецЦикла;
	
	Возврат СтрСоединить(Строки, Разделитель);
	
КонецФункции

#КонецОбласти

#Область Инициализация

Ошибки = Новый Массив;

#КонецОбласти

#КонецЕсли