
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФормулаПрименимостиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Если Объект.ФормулаПрименимости <> ВыбранноеЗначение Тогда
		Объект.ФормулаПрименимости = ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьФормулуПрименимости(Команда)
	
	ПараметрыОткрытия = Новый Структура("ЗакрыватьПриВыборе, ФормулаПрименимости", Истина, Объект.ФормулаПрименимости);
	ОткрытьФорму("Справочник.ИнспектируемыеЭлементы.Форма.ФормаРедактораФормулыПрименимости",
		ПараметрыОткрытия,
		Элементы.ФормулаПрименимости,
		УникальныйИдентификатор,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

#КонецОбласти
