////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция СформироватьОтчет(ДатаОтчета, ТекстОшибки ="", ПараметрыВывода = Неопределено) Экспорт		
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Отчеты.ОтчетНекомплектныеАвтомобилиWEB.ПолучитьМакет("Макет");
	ТекстОшибки = "";
	ТабДокумент.Очистить();
	Если НЕ ЗначениеЗаполнено(ДатаОтчета)Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НекомплектыОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(НекомплектыОстатки.КоличествоОстаток) КАК КоличествоНом
		|ПОМЕСТИТЬ ГруппировкаПоНом
		|ИЗ
		|	РегистрНакопления.Некомплекты.Остатки(&Дата, ) КАК НекомплектыОстатки
		|ГДЕ
		|	НекомплектыОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НекомплектыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НекомплектыОстатки.Заказ,
		|	НекомплектыОстатки.Номенклатура.Наименование + "", "" + НекомплектыОстатки.Номенклатура.КодЗавода КАК Номенклатура,
		|	СУММА(НекомплектыОстатки.КоличествоОстаток) КАК Количество,
		|	ГруппировкаПоНом.КоличествоНом
		|ИЗ
		|	РегистрНакопления.Некомплекты.Остатки(&Дата, ) КАК НекомплектыОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппировкаПоНом КАК ГруппировкаПоНом
		|		ПО НекомплектыОстатки.Номенклатура = ГруппировкаПоНом.Номенклатура
		|ГДЕ
		|	НекомплектыОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НекомплектыОстатки.Заказ,
		|	НекомплектыОстатки.Номенклатура.Наименование + "", "" + НекомплектыОстатки.Номенклатура.КодЗавода,
		|	ГруппировкаПоНом.КоличествоНом
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруппировкаПоНом.КоличествоНом УБЫВ
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Номенклатура";

	Запрос.УстановитьПараметр("Дата", ДатаОтчета);

	Результат = Запрос.Выполнить();
	
	СекцияШапка = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(СекцияШапка);

	ВыборкаНоменклатура = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаНоменклатура.Следующий() Цикл
		СекцияСтрока = Макет.ПолучитьОбласть("СтрНоменклатура");
		ЗаполнитьЗначенияСвойств(СекцияСтрока.Параметры,ВыборкаНоменклатура);
		СекцияСтрока.Параметры.ОбщКолво = ВыборкаНоменклатура.Количество;
		ТабДокумент.Вывести(СекцияСтрока);

		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СекцияСтрока = Макет.ПолучитьОбласть("СтрЗаказ");
			ЗаполнитьЗначенияСвойств(СекцияСтрока.Параметры,ВыборкаДетальныеЗаписи);
			ТабДокумент.Вывести(СекцияСтрока);
		КонецЦикла;
	КонецЦикла;

	    	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
