Функция ПолучитьТекущийЗаказ(РабочееМестоОператора, ИгнорироватьСтатус) Экспорт
	
	Заказ = Справочники.Заказы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущийЗаказНаСтанции.Заказ
		|ИЗ
		|	РегистрСведений.ТекущийЗаказНаСтанции КАК ТекущийЗаказНаСтанции
		|ГДЕ
		|	ТекущийЗаказНаСтанции.РабочееМестоОператора = &РабочееМестоОператора
		|	И НЕ ТекущийЗаказНаСтанции.ОтсканированПолностью";
	
	Если ИгнорироватьСтатус = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ТекущийЗаказНаСтанции.ОтсканированПолностью", "");	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("РабочееМестоОператора", РабочееМестоОператора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Заказ = ВыборкаДетальныеЗаписи.Заказ;
		
	КонецЦикла;
	
	Возврат Заказ;
	
КонецФункции

Процедура СохранитьСостояниеЗаказа(РабочееМестоОператора, Заказ, ОтканированПолностью) Экспорт

	НоваяЗапись = РегистрыСведений.ТекущийЗаказНаСтанции.СоздатьМенеджерЗаписи();
	НоваяЗапись.РабочееМестоОператора = РабочееМестоОператора;
	НоваяЗапись.Заказ = Заказ;
	НоваяЗапись.ОтсканированПолностью = ОтканированПолностью;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры