
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьАктаНаБрак)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьАктаНаБрак(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьАктаНаБрак(ТабДок, ПараметрКоманды)
	Документы.АктДефектации.ПечатьАктаНаБрак(ТабДок, ПараметрКоманды);
КонецПроцедуры
