
&НаКлиенте
Процедура ТолькоАктуальныеТресхолды(Команда)
	Элементы.ТолькоАктуальныеТресхолды.Пометка = Не Элементы.ТолькоАктуальныеТресхолды.Пометка;
	УстановкаОтборов(Элементы.ТолькоАктуальныеТресхолды.Пометка);
КонецПроцедуры

&НаСервере
Процедура УстановкаОтборов(СкрытьАрхив)
	Если СкрытьАрхив Тогда
	Список.ТекстЗапроса = Список.ТекстЗапроса +  "
	|ГДЕ
	|	НЕ СправочникТресхолды.Архив";
	Иначе	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"
	|ГДЕ
	|	НЕ СправочникТресхолды.Архив","");
	КонецЕсли;
КонецПроцедуры

