#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#Область Прочее

////////////////////////////////////////////////////////////////////////////////
// Прочее 

Функция СобытиеЖурнала(Подсобытие = "") Экспорт
	
	Возврат НСтр("ru='Веб-интерфейсы'; en = 'Web interfaces'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка())
		+ ?(ПустаяСтрока(Подсобытие),"",".") + Подсобытие;
		
КонецФункции 

#КонецОбласти


#Область Сессии

////////////////////////////////////////////////////////////////////////////////
// Работа с Сессиями

Функция СоздатьСессию(ИдентификаторНаВебСервере = Неопределено, IPАдресКлиента = Неопределено, DNSИмяКлиента = Неопределено) Экспорт
	ТипИнтерфейса = ПредопределенноеЗначение("Перечисление.ТипыИнтерфейсовПользователей.Веб");
	
	ПараметрыСессииНаВебСервере = Новый Структура;
	ПараметрыСессииНаВебСервере.Вставить("ИдентификаторНаВебСервере", ИдентификаторНаВебСервере);
	ПараметрыСессииНаВебСервере.Вставить("IPАдресКлиента", IPАдресКлиента);
    ПараметрыСессииНаВебСервере.Вставить("DNSИмяКлиента", IPАдресКлиента);
	
	Сессия =  Справочники.СессииПользователей.СоздатьСессию(ТипИнтерфейса, ПараметрыСессииНаВебСервере);
	СессияСсылка = Сессия.Ссылка;
	
	Комментарий = НСтр("ru='Создана сессия'; en = 'Session started'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	Событие = НСтр("ru='Сессия';en='Session'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
	ЗаписьЖурналаРегистрации(СобытиеЖурнала(Событие), УровеньЖурналаРегистрации.Информация, СессияСсылка.Метаданные()
		, СессияСсылка, Комментарий);

	Возврат Сессия;		
КонецФункции

#КонецОбласти


