
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуЗагрузки(Форма, Параметры) Экспорт
	ОткрытьФорму("ОбщаяФорма.ФормаЗагрузкиИзВнешнегоФайла", Параметры, Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ПараметрыДляЗагрузкиЗаказов() Экспорт
	
	ПередаваемыеПараметры = Новый Структура();
	
	Колонки = Новый Структура;
	Колонки.Вставить("VIN", "VIN");	
	ПередаваемыеПараметры.Вставить("Колонки", Колонки);
	ШиринаКолонок = Новый Структура("VIN", 20);
	ПередаваемыеПараметры.Вставить("ШиринаКолонок", ШиринаКолонок);	
	ПередаваемыеПараметры.Вставить("Каталог", "");
	ПередаваемыеПараметры.Вставить("ПоказыватьФлагОчищать", Ложь);
	
	Возврат ПередаваемыеПараметры;
	
КонецФункции

Процедура ЗагрузкаЗаказов_ОбработкаОповещения(ИмяСобытия, Параметр, Источник, Форма) Экспорт
	
	Если НЕ Форма = Источник Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПереданыДанныеИзФормыЗагрузки" Тогда
		ТекстСообщения = "";
		Успешно = Форма.ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр, ТекстСообщения);
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСТР("ru='" + ТекстСообщения + "';en='" + ТекстСообщения + "'"));
		КонецЕсли; 
	КонецЕсли;
	
	Если Успешно Тогда
		ПоказатьПредупреждение(, НСтр("ru='Заказы добавлены.';en='Orders were added.'"));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Заказы не добавлены.';en='Orders were not added.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
