
//СтруктураВходныхПараметров = Новый Структура("Дата, Событие, УровеньСобытия, Значение, Станция, Заказ, СообщениеОператору");
//	Дата - просто дата в регистре
//	Событие - ссылка на справочник "Классификаторы событий"
//	УровеньСобытия - ссылка на перечисление "Уровни события"
//  Значение - отсканированное значение (если было)
//	Станция - ссылка на справочник "Рабочее место оператора"
//	Заказ - ссылка на заказ
//	СообщениеОператору - та строка, что вернулась оператору
Процедура ЗафиксироватьИнформационноеСообщение(СтруктураВходныхПараметров) Экспорт
	
	СтруктураВходныхПараметров.СообщениеОператору = РегистрыСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.УбратьНедопустимыеСимволы(СтруктураВходныхПараметров.СообщениеОператору);
	СтруктураВходныхПараметров.СообщениеОператору = Лев(СтруктураВходныхПараметров.СообщениеОператору, 300);
	НачатьТранзакцию();
	
		РегистрСв = РегистрыСведений.ЖурналОперацийQLS.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(РегистрСв, СтруктураВходныхПараметров); 
		
		РегистрСв.Период = ТекущаяДата();		
		Если Не ЗначениеЗаполнено(РегистрСв.Дата) Тогда
			РегистрСв.Дата = ТекущаяДата();
		КонецЕсли;
		
		Попытка
			РегистрСв.Записать(Ложь);
		Исключение
			
		КонецПопытки;
		
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
