Процедура АктуализироватьРегистрСведений() Экспорт
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НетиповыеОбменыДанными.Ссылка КАК ОбменДанными
		|ИЗ
		|	Справочник.НетиповыеОбменыДанными КАК НетиповыеОбменыДанными
		|ГДЕ
		|	НетиповыеОбменыДанными.РегламентноеЗаданиеGUID > """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	НаборЗаписей = РегистрыСведений.БлокировкиРегламентныхЗаданийНетиповыхОбменов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.БлокировкиРегламентныхЗаданийНетиповыхОбменов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбменДанными = ВыборкаДетальныеЗаписи.ОбменДанными;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
