#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтоимостьПоУИД(УИД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	СтоимостиКонсерна.СтоимостьКонсерна КАК СтоимостьКонсерна
	|ИЗ
	|	РегистрСведений.СтоимостиКонсерна КАК СтоимостиКонсерна
	|ГДЕ
	|	СтоимостиКонсерна.УИД = &УИД";
	
	Запрос.УстановитьПараметр("УИД", УИД);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		//Ошибка
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.СтоимостьКонсерна;
	
КонецФункции

// Получить все списком значений.
// 
// Возвращаемое значение:
//  СписокЗначений - Получить все списком значений
Функция ПолучитьВсеСпискомЗначений() Экспорт
	
	СписокСтоимостей = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтоимостиКонсерна.СтоимостьКонсерна КАК СтоимостьКонсерна
		|ИЗ
		|	РегистрСведений.СтоимостиКонсерна КАК СтоимостиКонсерна
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьКонсерна";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокСтоимостей.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("СтоимостьКонсерна"));	
	КонецЕсли;
	
	Возврат СписокСтоимостей;
	
КонецФункции

#КонецОбласти

#КонецЕсли