 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ПараметрыСериализации Экспорт;

#КонецОбласти 

#Область ПрограммныйИнтерфейс

Функция Сериализовать(Значение, Параметры = Неопределено) Экспорт
	Возврат СериализацияСервер.ЗначениеВСтрокуJSON(Значение, ?(Параметры = Неопределено, ПараметрыСериализации, Параметры));	
КонецФункции

Функция Десериализовать(Строка, ТипXDTO = Неопределено, Параметры = Неопределено) Экспорт
	Если ТипXDTO = Неопределено Тогда
		Возврат СериализацияСервер.СтрокаJSONВЗначение(Строка, Параметры);
	Иначе
		ПараметрыДесериализации = Новый Структура("УдалитьПустыеМассивы", Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыДесериализации, ?(Параметры = Неопределено, Новый Структура, Параметры), Истина);
		Возврат СериализацияСервер.СтрокаJSONВЗначениеXDTO(Строка, ТипXDTO, ПараметрыДесериализации);
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область Инициализация

ПараметрыСериализации = Новый Структура();
ПараметрыСериализации.Вставить("ПараметрыЗаписиJSON", Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, "  "));

#КонецОбласти

#КонецЕсли