 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнениеОбработкиСервисовИнтеграции() Экспорт
 	
 	Попытка
 		СервисыИнтеграции.ВыполнитьОбработку();
 	Исключение
 		ИнформацияОбОшибке = ИнформацияОбОшибке();
 		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка обработки сервисов интеграции: 
			|<%1>'"), 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
 		ЗаписьЖурналаРегистрации("Сервисы интеграции", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
 	КонецПопытки;
    
КонецПроцедуры

#КонецОбласти
