
Процедура ПередЗаписью(Отказ)
	
	Если ИспользоватьСетку <> Ссылка.ИспользоватьСетку
		Или КоличествоКолонок <> Ссылка.КоличествоКолонок
		Или КоличествоСтрок <> Ссылка.КоличествоСтрок Тогда
		ДополнительныеСвойства.Вставить("ОчиститьЗаписиРегистра", Истина);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("ОчиститьЗаписиРегистра") Тогда
		НаборЗаписей = РегистрыСведений.ВариантыИспользованияИнспектируемыхЭлементовНаИзображениях.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Изображение.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры


