
Функция GetWorkstationsListGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокДоступныхРабочихМест(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция GetWorkstationGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ИнформацияПоРабочемуМесту(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция GetOrderByBarcodeGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ИнформацияПоЗаказу(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция GetInspectionItemsListGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокИнспектируемыхЭлементов(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RegisterOrderQualityStatusPOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияСтатусаКачестваЗаказа(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RegisterOrderQualityStatusOption(Запрос)
	
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	Ответ.ВставитьЗаголовок("Access-Control-Allow-Headers", "content-type");
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция CompleteOrderInspectionPOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ЗавершитьИнспекцию(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция CompleteOrderInspectionOption(Запрос)
	
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	Ответ.ВставитьЗаголовок("Access-Control-Allow-Headers", "content-type");
		
	Возврат Ответ.Получить();
	
КонецФункции

Функция GetConsernListGet(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокКонсерновЗаказа(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция GetDefectListGet(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокДефектовРабочегоМеста(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RepairerCloseDefectPOST(Запрос)          
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияРемонтаЗаказа(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
КонецФункции

Функция RepairerCompleteInspectionPOST(Запрос)
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ЗавершитьИнспекциюРемонтника(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
КонецФункции

Функция RepairerGetDataGet(Запрос)
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ДанныеРемонтника(ЗапросОбъект, Ответ);   
	
	Возврат Ответ.Получить();
КонецФункции

Функция RepairerCompleteTaskPOST(Запрос)
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ВыполнитьЗадачу(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
КонецФункции

Функция getCampaignsListGet(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокКампанийЗаказа(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить(); 
	
КонецФункции

Функция GetCheckListGet(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокКонтролируемыхКонсерновЗаказа(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция CheckCompletePOST(Запрос)
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияОперацииПоКонтролю(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
КонецФункции

Функция GetImageGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ПолучитьИзображениеПоИдентификатору(ЗапросОбъект, Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция GetImageMapGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СписокИзображенийТочкиПроверкиКачества(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RemoveOrderFromCampaignPOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СнятиеЗаказаСКампании(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить()
	
КонецФункции

Функция RegisterOrderQualityStatusFromDevicePOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияСтатусаКачестваЗаказаОтОборудования(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RegisterOrderQualityStatusFromDeviceOption(Запрос)
	
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	Ответ.ВставитьЗаголовок("Access-Control-Allow-Headers", "content-type");
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RepairerCloseDefectFromDevicePOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияРемонтаЗаказаОтОборудования(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RemoveOrderFromCampaignFromDevicePOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.СнятиеЗаказаСКампании(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить()
	
КонецФункции

Функция CheckCompleteFromDevicePOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияОперацииПоКонтролюОтОборудования(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции

Функция RegisterOrderForCampaignFromDevicePOST(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.РегистрацияЗаказаНаКампанию(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить()
	
КонецФункции

Функция GetResponsibleForInspectionItemGET(Запрос)
	
	ЗапросОбъект = ВебПриложениеРасширяемый.НовыйНТТРЗапрос(Запрос);
	Ответ = ВебПриложениеРасширяемый.НовыйНТТРОтвет();
	
	Worstation_2_0_ОбщиеФункции.ОтветственныйЗаИнспектируемыйЭлемент(ЗапросОбъект, Ответ);
	
	Возврат Ответ.Получить();
	
КонецФункции
