//Варианты ответов ACK,NAK,VINНеНайден,WrongData
Функция ОпределитьЗначенияОтветов(Заказ=" ",Ссылка,ТекстОшибки,ТолькоVinНеНайден=Ложь) Экспорт
	
	ВариантыОтветов = новый Структура("ACK,NAK,VINНеНайден,WrongData","","","","");
	
	//Если Не ТолькоVinНеНайден Тогда
	Попытка
		ВариантыОтветов.ACK = ВычислитьВыражение(Ссылка.ФормулаДляОтвета_ACK,Заказ);
	Исключение
		ТекстОшибки = НСтр("ru='Ошибка вычисления формулы в поле ""Формула для ответа ""ACK"":';en='Error of calculation of formula in the field ""Formula for response ""ACK""'")+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	Попытка
		ВариантыОтветов.NAK = ВычислитьВыражение(Ссылка.ФормулаДляОтвета_NAK,Заказ);
	Исключение
		ТекстОшибки = НСтр("ru='Ошибка вычисления формулы в поле ""Формула для ответа ""NAK"":';en='Error of calculation of formula in the field ""Formula for response ""NAK""'")+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	Попытка
		ВариантыОтветов.WrongData = ВычислитьВыражение(Ссылка.ФормулаДляОтвета_ОшибкаВоВходящихДанных,Заказ);
	Исключение
		ТекстОшибки = НСтр("ru='Ошибка вычисления формулы в поле ""Формула для ответа ""WrongData"":';en='Error of calculation of formula in the field ""Formula for response ""WrongData""'")+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	//КонецЕсли;
	
	Попытка
		ВариантыОтветов.VINНеНайден = ВычислитьВыражение(Ссылка.ФормулаДляОтвета_НеНайденVIN,"");
	Исключение
		ТекстОшибки = НСтр("ru='Ошибка вычисления формулы в поле ""Формула для ответа ""Не найден VIN"":';en='Error of calculation of formula in the field ""Formula for response ""VIN is not found""'")+Символы.ПС+ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ВариантыОтветов;
	
КонецФункции

Функция ВычислитьВыражение(Выражение,Параметр)
	перем Результат,Заказ,Номенклатура;
	
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Заказы") Тогда
		Заказ = Параметр;
	КонецЕсли;
	
	Результат = "";
	Если ПустаяСтрока(Выражение) Тогда
		Возврат "";
	КонецЕсли; 
	Попытка
		Выполнить("Результат = "+Выражение);
	Исключение
		ВызватьИсключение НСтр("ru='Произошла ошибка вычисления выражения ""';en='An error occurred during calculation of the expression ""'")+Выражение+""" - """+ОписаниеОшибки()+"""";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ВычислитьВыражение
