
Функция ПолучитьОписаниеОбработкиОбмена() Экспорт
	
	// полный состав параметров описания смотри в этой функции
	СтруктураНастроек = Справочники.НетиповыеОбменыДанными.ПолучитьОписаниеОбработкиОбменаПоУмолчанию();
	СтруктураНастроек.ТекстовоеОписаниеОбмена = "выдача по VIN состояния ";
	СтруктураНастроек.ВидОбмена = Перечисления.ВидыОбмена.Двунаправленный;
	СтруктураНастроек.XML_НастройкаОбязательна = Истина;
	СтруктураНастроек.ДляМножественныхОбменов = Ложь;
	СтруктураНастроек.СпособПередачиДанных = Перечисления.СпособыПередачиДанныхВНетиповыхОбменах.WebService_Host;
	СтруктураНастроек.ПредопределенныеОбмены.Добавить(Справочники.НетиповыеОбменыДанными.MES_QLS_GET_UNIT_STATUS_UNLOAD);
	
	Возврат СтруктураНастроек;
КонецФункции 

Функция ПодготовитьОтветноеСообщение(VIN,VINНайден=Истина)
	
//"00038001000000002503001000000XY999990" + '\0' 
//Длина сообщения  = "00038" 
//Количество сообщений в строке = "001" 
//Ошибка в сообщении = "00000" 
//Длина сообщения с ответом QLS  = "00025" 
//Идентификатор запроса  = "03001" 
//Ошибка в ответе от QLS = "00000" 
//Метод идентификации = "0" 
//7 последних символов VIN (правых)= "XY999999" 

Возврат "00038001000000002503001"+?(VINНайден,"00000","XXXXX")+"0"+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Прав(VIN,7),7," ","Справа")+" ";
	
КонецФункции

Функция ВыполнитьОбмен(Событие, НастройкаОбмена, ВходящиеПараметры) Экспорт
	
	// пока поступим просто - считаем, что в переданной строке последние 17 символов - это VIN
	СтрокаVIN = Лев(ВходящиеПараметры,17);
	// найдем заказ
	Заказ = Справочники.Заказы.НайтиПоНаименованию(СокрЛП(СтрокаVIN),Истина);
	Если Заказ.Пустая() Тогда
		Возврат ПодготовитьОтветноеСообщение(СтрокаVIN,Ложь)+"0";
	КонецЕсли;
	
	ДетализацияИнформацииПоДефектам = "";
	ДетализацияИнформацииПоНепройденнымТочкам= "";
	ЕстьДефекты = QNS.КонтрольНаличияОткрытыхКонсернов(Заказ,ДетализацияИнформацииПоДефектам);
	ЕстьНепройденныеОбязательныеТочкиКонтроляКачества = Не QNS.ТочкиПроверкиКачестваПройдены(Заказ,,ДетализацияИнформацииПоНепройденнымТочкам);
	Если ЕстьДефекты Тогда
		Возврат ПодготовитьОтветноеСообщение(СтрокаVIN)+"1";
	ИначеЕсли ЕстьНепройденныеОбязательныеТочкиКонтроляКачества Тогда
		Возврат ПодготовитьОтветноеСообщение(СтрокаVIN)+"2";
	Иначе	
		// все ОК
		Возврат ПодготовитьОтветноеСообщение(СтрокаVIN)+"0";
	КонецЕсли;
		
КонецФункции
