#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// Session

Функция CreateSessionPOST(Запрос)
	
	Перем ПараметрыЗапросаКлиента, ПараметрыОтветаКлиенту;
	Перем Ответ;
	Перем ИдентификаторСессии, ИдентификаторСессииВебСервера, IPАдресКлиента, DNSИмяКлиента;
		
	ДополнительныеПараметры = Новый Структура;
	ИнициализироватьДополнительныеПараметры(ДополнительныеПараметры, "CreateSession.POST");
		
	Попытка
		
		//Если МобильныеВебИнтерфейсыСервер.ЗапрещенДоступКИнтерфейсамТекущемуПользователю() Тогда 
		//	Возврат РаботаСВебСлужбамиСервер.ПодготовитьОтветОшибкаДоступа(ДополнительныеПараметры);
		//КонецЕсли;
		
		ПараметрыЗапросаКлиента = РаботаСВебСлужбамиСервер.ОбработатьЗапрос(Запрос, , ДополнительныеПараметры);	
		ПараметрыЗапросаКлиента.Свойство("webUUID"  , ИдентификаторСессииВебСервера);
		ПараметрыЗапросаКлиента.Свойство("clientIP" , IPАдресКлиента);
		ПараметрыЗапросаКлиента.Свойство("clientDNS", DNSИмяКлиента);
		
		ПараметрыОтветаКлиенту = Новый Структура;
		ПараметрыОтветаКлиенту.Вставить("session"  , "");
		ПараметрыОтветаКлиенту.Вставить("timeout"  , 0);
		ПараметрыОтветаКлиенту.Вставить("settings" , "");
		ПараметрыОтветаКлиенту.Вставить("error"    , Ложь);
		ПараметрыОтветаКлиенту.Вставить("errorMess", "");
				
		Сессия = МобильныеВебИнтерфейсыСервер.СоздатьСессию(ИдентификаторСессииВебСервера, IPАдресКлиента, DNSИмяКлиента);
		ИдентификаторСессии = СокрЛП(Сессия.Идентификатор);
		ПараметрыОтветаКлиенту.session = ИдентификаторСессии;
		
		ПараметрыОтветаКлиенту.timeout = Сессия.МаксимальноеВремяБездействия;
		
		Сессия = Неопределено;
		
		НастройкиПриложения = Неопределено;
		Обработки.ВебИнтерфейсОсновной.ЗаполнитьНастройкиПриложения(Сессия, Неопределено, НастройкиПриложения);
		ПараметрыОтветаКлиенту.settings = НастройкиПриложения;
		
		Ответ = РаботаСВебСлужбамиСервер.ПодготовитьОтвет(ПараметрыОтветаКлиенту, ДополнительныеПараметры);
		РаботаСВебСлужбамиСервер.УстановитьCookie(Ответ, "wms_sid", ИдентификаторСессии);

	Исключение
		//??РаботаСВебСлужбамиСервер.ЗарегистрироватьВЖурналеОшибкуОбработкиДанных(ИнформацияОбОшибке(), ДополнительныеПараметры);
		//??Ответ = РаботаСВебСлужбамиСервер.ПодготовитьОтветОшибкаОбработкиДанных(ДополнительныеПараметры);		
	КонецПопытки;	
	
	Возврат Ответ;

КонецФункции



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДополнительныеПараметры(ДополнительныеПараметры, ДанныеДляРегистрации)

	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли; 

	ДополнительныеПараметры.Вставить("МетаОбъектДляРегистрации", Метаданные.HTTPСервисы.MobileInterface);
	ДополнительныеПараметры.Вставить("ДанныеДляРегистрации", ДанныеДляРегистрации);
	ДополнительныеПараметры.Вставить("СобытиеЖурнала", МобильныеВебИнтерфейсыСервер.СобытиеЖурнала());
	ДополнительныеПараметры.Вставить("НачалоОбработки", ТекущаяУниверсальнаяДатаВМиллисекундах());

КонецПроцедуры



#КонецОбласти
