&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если создаём записи в регистре из формы "Изображения для выбора инспектируемого элемента", то переносим с той формы ссылку на изображение
	Если Параметры.Свойство("Изображение") Тогда
		Параметры.Свойство("Изображение", Запись.Изображение);
	КонецЕсли;
	
	Запись.ИнспектируемыйЭлемент = Запись.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.Владелец;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантИспользованияИнспектируемогоЭлементаНаИзображенииПриИзменении(Элемент)
	ОбновитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость()
	
	//По умолчанию все элементы доступны
	Элементы.ЗначениеВариантаПозицийA.Доступность = Истина;
	Элементы.ЗначениеВариантаПозицийB.Доступность = Истина;
	Элементы.ЗначениеВариантаПозицийC.Доступность = Истина;
	
	//В зависимости от варианта испльзования, управляем доступностью и заполненными значениями вариантов
	Если Не Запись.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюA Тогда
		Элементы.ЗначениеВариантаПозицийA.Доступность = Ложь;
		Запись.ЗначениеВариантаПозицийA = Справочники.ВариантыПозицииA.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Запись.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюB Тогда
		Элементы.ЗначениеВариантаПозицийB.Доступность = Ложь;
		Запись.ЗначениеВариантаПозицийB = Справочники.ВариантыПозицииA.ПустаяСсылка();
	КонецЕсли;
	
	Если Не Запись.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюC Тогда
		Элементы.ЗначениеВариантаПозицийC.Доступность = Ложь;
		Запись.ЗначениеВариантаПозицийC = Справочники.ВариантыПозицииA.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантИспользованияИнспектируемогоЭлементаНаИзображенииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Запись.ИнспектируемыйЭлемент = ПолучитьИЭДляВариантаИспользованияИЭ(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запись.ИнспектируемыйЭлемент = Запись.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.Владелец;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИЭДляВариантаИспользованияИЭ(ВариантИЭ)
	
	Возврат ВариантИЭ.Владелец; 
	
КонецФункции
