
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РабочееВремяСмен
	Движения.РабочееВремяСмен.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаДокумента Из ТаблицаДокумента Цикл
		Движение = Движения.РабочееВремяСмен.Добавить();
		Движение.Период = Дата;
		Движение.Смена = ТекСтрокаТаблицаДокумента.Смена;
		Движение.ВремяНачала = ТекСтрокаТаблицаДокумента.ВремяНачала;
		Движение.ВремяОкончания = ТекСтрокаТаблицаДокумента.ВремяОкончания;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
