#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	
	Возврат Справочники.ПулыИнспектируемыхЭлементов.НайтиПоРеквизиту("Идентификатор", Идентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоВалидныйИдентификатор(Идентификатор) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор)
		Или ОбщегоНазначенияQLS.ЭтоСтроковыйИдентификатор(Идентификатор);
		
КонецФункции

#КонецОбласти

#КонецЕсли
