
#Область ПрограммныйИнтерфейс

// Вычисляет формулу применимости инспектируемого элемента к заказу.
//
// Параметры:
//  ФормулаПрименимости - Строка - текст формулы на языке "1С".
//  Заказ - СправочникСсылка.Заказы - проверяемый заказ.
//
// Возвращаемое значение:
//  Булево - результат вычисления формулы применимости.
//
Функция ВычислитьФормулуПрименимости(Знач ФормулаПрименимости, Знач Заказ) Экспорт
	
	// Если ФормулаПрименимости - пустая строка, считаем, что ограничений нет.
	// Возвращаем Истина.
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ФормулаПрименимости) Тогда
		Попытка
			Выполнить("Результат = " + ФормулаПрименимости);
		Исключение
			Результат = Ложь;
			ВызватьИсключение "Ошибка вычисления формулы применимости:" + Символы.ПС + ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;
	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
