
Процедура ПечатьАктаНаБрак(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьАктаНаБрак)
	Макет = Документы.АктДефектации.ПолучитьМакет("ПечатьАктаНаБрак");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктДефектации.Виновник,
	|	АктДефектации.Дата,
	|	АктДефектации.ДатаВыходаВГр,
	|	АктДефектации.ДатаПрихода,
	|	АктДефектации.Деталь,
	|	АктДефектации.Дефект,
	|	АктДефектации.Заказ,
	|	АктДефектации.ЗаключениеТехнолога,
	|	АктДефектации.ЗатратыВсего,
	|	АктДефектации.Количество,
	|	АктДефектации.КоментарииКАвто,
	|	АктДефектации.КомментарийВиновнойСтороны,
	|	АктДефектации.Модель,
	|	АктДефектации.Номер,
	|	АктДефектации.НомерДетали,
	|	АктДефектации.ОмтсСтатус,
	|	АктДефектации.Основание,
	|	АктДефектации.Примечание,
	|	АктДефектации.Статус,
	|	АктДефектации.Точка
	|ИЗ
	|	Документ.АктДефектации КАК АктДефектации
	|ГДЕ
	|	АктДефектации.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
