
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	АктДефектации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.АктДефектации КАК АктДефектации
	               |ГДЕ
	               |	АктДефектации.Основание = &Основание";
	запрос.УстановитьПараметр("Основание",ДанныеЗаполнения.Ссылка);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВызватьИсключение "Акт на брак по этой операции уже существует с номером: " + Строка(Выборка.ссылка.номер);
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОперацияПоКачеству") Тогда
		// Заполнение шапки
		Количество = 1;
		Модель = ДанныеЗаполнения.Заказ.модель;
		Заказ = ДанныеЗаполнения.Заказ;
		Деталь = ДанныеЗаполнения.ИнспектируемыйЭлемент;
		Виновник = ДанныеЗаполнения.ОтветственныйЗаДефект;
		основание = ДанныеЗаполнения.Ссылка;
		Дефект = ДанныеЗаполнения.Дефект;
		Статус = Перечисления.СтатусыАктовНаБрак.ВРаботе;
		
		//++ Иватов
		Точка = ДанныеЗаполнения.ТочкаПроверкиКачества; 
		//ДатаВыходаВГр = ДанныеЗаполнения.Дата;
		//-- Иватов
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
