&НаКлиенте
Процедура ОтборПоПеречнюЗаказов(Команда)
	перем времТекстовыйПереченьVIN;
	СписокЗаказов = Новый СписокЗначений;
	
	
	Если Элементы.ФормаОтборПоПеречнюЗаказов.Пометка Тогда
		ИспользованиеОтбора = Ложь;
	Иначе
		времТекстовыйПереченьVIN = ТекстовыйПереченьVIN;
		Если Не ВвестиСтроку(времТекстовыйПереченьVIN,НСтр("ru='Введите значения VIN или № заказа (каждый с новой строки)';en='Enter the values of VIN or N of order (each from a new line)'"),,Истина) Тогда
			Возврат;
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(времТекстовыйПереченьVIN) Тогда
			ИспользованиеОтбора = Ложь;
		Иначе
			ТекстОшибки = "";
			СписокЗаказов = ПолучитьСписокЗаказовПоСпискуVIN(времТекстовыйПереченьVIN,ТекстОшибки);
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				Предупреждение(ТекстОшибки);
				ИспользованиеОтбора = Ложь;
			Иначе
				ИспользованиеОтбора = Истина;
				ТекстовыйПереченьVIN = времТекстовыйПереченьVIN;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
								"Заказ",
								СписокЗаказов,
								ВидСравненияКомпоновкиДанных.ВСписке,
								,
								ИспользованиеОтбора);
								
	Элементы.ФормаОтборПоПеречнюЗаказов.Пометка = ИспользованиеОтбора;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗаказовПоСпискуVIN(ТекстовыйСписокVIN,ТекстОшибки)

	Возврат Производство.ПолучитьСписокЗаказовПоСпискуVIN(ТекстовыйСписокVIN,ТекстОшибки);
	
КонецФункции // ПолучитьСписокЗаказовПоСпискуVIN(ОтборVIN,ТекстОшибки)()

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	КоличествоВыделенныхСтрок = ВыделенныеСтроки.Количество();
	Сч = 0;
	Если ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
			СтрокаТабл = Элементы.Список.ДанныеСтроки(ТекСтрока);
			Если ЗначениеЗаполнено(СтрокаТабл.ВидОбмена) И ЗначениеЗаполнено(СтрокаТабл.Объект) Тогда
			    ИзменитьВПлане(СтрокаТабл.ВидОбмена, СтрокаТабл.Объект);
				Сч = Сч + 1;
			Иначе
				Сообщение = Новый СообщениеПользователю;
				Если НЕ ЗначениеЗаполнено(СтрокаТабл.ВидОбмена) Тогда
				    Сообщение.Текст = НСтр("ru='Вид обмена для строки ';en='Kind of exchange for the line '") + Строка(ТекСтрока) + НСтр("ru=' не заполнен. Изменения для данной строки не зарегистрированы';en=' is not filled. Changes for this line were not registered'");
				ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТабл.Объект) Тогда
					Сообщение.Текст = НСтр("ru='Объект для строки ';en='Object for the line '") + Строка(ТекСтрока) + НСтр("ru=' не заполнен. Изменения для данной строки не зарегистрированы';en=' is not filled. Changes for this line were not registered.'");
				ИначеЕсли (НЕ ЗначениеЗаполнено(СтрокаТабл.ВидОбмена)) И НЕ (ЗначениеЗаполнено(СтрокаТабл.Объект)) Тогда	
					Сообщение.Текст = НСтр("ru='Объект и план обмена для строки ';en='Object and exchange plan for the line '") + Строка(ТекСтрока) + НСтр("ru=' не заполнены. Изменения для данной строки не зарегистрированы';en=' are not filled. Changes for this line were not registered'");
				КонецЕсли;
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	Если Сч = КоличествоВыделенныхСтрок Тогда
		ПоказатьПредупреждение(НСтр("ru='Все изменения зарегистрированы!';en='All the changes were registered!'"),,НСтр("ru='Окончание регистрации';en='Ending of registration'"));
	ИначеЕсли Сч < КоличествоВыделенныхСтрок Тогда
		ПоказатьПредупреждение(НСтр("ru='Зарегистрированы ';en=''") + Строка(Сч) + НСтр("ru=' объектов из ';en=' objects of '") + Строка(КоличествоВыделенныхСтрок) + НСтр("ru='.';en=' were registered.'"),,НСтр("ru='Окончание регистрации';en='Ending of registration'"));
	КонецЕсли;	
	//ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	//ПараметрыДляФормы = Новый Структура;
	//Если ТекущиеДанные <> Неопределено Тогда
	//	ПараметрыДляФормы.Вставить("ВидОбмена", ТекущиеДанные.ВидОбмена);
	//	ПараметрыДляФормы.Вставить("ВыгружаемыйОбъект", ТекущиеДанные.Объект);
	//КонецЕсли;
	//ОткрытьФорму("ПланОбмена.НетиповыеОбмены.Форма.ФормаРегистрации", ПараметрыДляФормы, ЭтаФОрма);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВПлане(ВидОбмена, ТекОбъект)
	СоставПлана = ПланыОбмена.НетиповыеОбмены.ПустаяСсылка().Метаданные().Состав;
	
	МассивТипов = Новый Массив;
	Для Каждого ЭлементСостава Из СоставПлана Цикл
		Если Метаданные.Документы.Содержит(ЭлементСостава.Метаданные) Тогда
			МассивТипов.Добавить(Тип("ДокументСсылка."+ЭлементСостава.Метаданные.Имя));
		ИначеЕсли Метаданные.Справочники.Содержит(ЭлементСостава.Метаданные) Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка."+ЭлементСостава.Метаданные.Имя));
		КонецЕсли;
	КонецЦикла;
	
	//Элементы.ВыгружаемыйОбъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	//Элементы.ВыгружаемыйОбъект.ДоступныеТипы = Новый ОписаниеТипов(МассивТипов);
	
	Если ТипЗнч(ВидОбмена) = Тип("СправочникСсылка.НетиповыеОбменыДанными") Тогда
		УзелРегистрацииИзменений = ВидОбмена.УзелРегистрацииИзменений;
	Иначе
		УзелРегистрацииИзменений = ВидОбмена;
	КонецЕсли;
	
	ВыгружаемыйОбъект = ТекОбъект;
	ПланыОбмена.ЗарегистрироватьИзменения(УзелРегистрацииИзменений, ВыгружаемыйОбъект);
КонецПроцедуры	
