#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций

&НаКлиенте
Процедура ГруппыВариантыПозицииСПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.
	ЗначениеДляСравнения = ПредопределенноеЗначение("Справочник.ГруппыВариантовПозицииС.ПустаяСсылка");
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда 
		ЗначениеДляСравнения = Элемент.ТекущаяСтрока;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СправочникВариантыПозицииC,
																			"Владелец", ЗначениеДляСравнения,
																			ВидСравненияКомпоновкиДанных.Равно, , Истина,
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,
																			)
																			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
