
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Некомплекты.Записывать = Истина;
	Движение = Движения.Некомплекты.Добавить();
	Движение.ВидДвижения = ?(ОперацияНекомплекта=Перечисления.ОперацииНекомплектов.Регистрация,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Номенклатура = Номенклатура;
	Движение.Количество = Количество;
	Движение.Смена = Смена;
    Движение.ДатаСмены = Производство.ПолучитьДатуСмены(Дата,Смена);
	
	Если ОперацияНекомплекта=Перечисления.ОперацииНекомплектов.Устранение Тогда
		Движения.Записать();
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НекомплектыОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.Некомплекты.Остатки(
			|			,
			|			Заказ = &Заказ
			|				И Номенклатура = &Номенклатура) КАК НекомплектыОстатки
			|ГДЕ
			|	НекомплектыОстатки.КоличествоОстаток < 0";

		Запрос.УстановитьПараметр("Заказ", Заказ);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);

		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
			ВызватьИсключение НСтр("ru='Невозможно зарегистрировать устранение некомплекта по заказу ';en='Unable to register the removing of deficiency by the order '")+Заказ+НСтр("ru=' ( номенклатура ""';en=' ( nomenclature ""'")+Номенклатура.КодЗавода+НСтр("ru='"": фактическое количество некомплекта меньше, чем указано в документе';en='"": actual quantity of deficiency is less, then specified in the document'");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
