
&НаКлиенте
Процедура АвтоматическоеУправлениеКампаниямиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование Тогда
		Отказ  = Истина;
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Прежде запишите элемент справочника.';en='First write the element of catalog.'"));
			Возврат;
		КонецЕсли; 
		
		ЭлементыОтбора = Новый Структура("Кампания", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
		ОткрытьФорму("РегистрСведений.АвтоматическоеУправлениеКампаниями.ФормаЗаписи", ПараметрыФормы); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвтоматическоеУправлениеКампаниями, "Кампания", Объект.Ссылка, Истина);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаНачала = ТекущаяДата();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ДатаОкончания) и Объект.ДатаНачала>Объект.ДатаОкончания Тогда
		Отказ = Истина;
		Сообщить(НСТР("ru='Дата окончания кампании должна быть больше даты начала';en='Campaign's end date  must be greater than start date'"));
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(АвтоматическоеУправлениеКампаниями, "Кампания", Объект.Ссылка, Истина);
КонецПроцедуры

