#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)    
	
	Если ОбменДанными.Загрузка Тогда
     		Возврат;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)     
	
	Движения.КонтрольКонсернов.Записывать = Истина;
	
	Если ОперацияКачества = Перечисления.ОперацииКачества.Ремонт 
		И ПроверкаВыполнена Тогда         
		
		Если ПовторныйРемонт Тогда  
			Движение = Движения.КонтрольКонсернов.Добавить();    
			
			Движение.ВидДвижения 			= ВидДвиженияНакопления.Расход;
			Движение.Период 				= Дата;
			Движение.Заказ 					= Заказ;
			Движение.Консерн 				= Консерн; 
			Движение.ТребуетсяПроверка 	= Ложь;
			Движение.Количество 			= 1;
		КонецЕсли;
			
		Движение = Движения.КонтрольКонсернов.Добавить();    
		
		Движение.ВидДвижения 			= ВидДвиженияНакопления.Приход;
		Движение.Период 				= Дата;
		Движение.Заказ 					= Заказ;
		Движение.Консерн 				= Консерн; 
		Движение.ТребуетсяПроверка 	= Истина;
		Движение.Количество 			= 1;
		
	ИначеЕсли ОперацияКачества = Перечисления.ОперацииКачества.Контроль Тогда 
		
		Движение = Движения.КонтрольКонсернов.Добавить();   

		Движение.ВидДвижения 			= ВидДвиженияНакопления.Расход;
		Движение.Период 				= Дата;
		Движение.Заказ 					= Заказ;
		Движение.Консерн 				= Консерн; 
		Движение.ТребуетсяПроверка 	= Истина;
		Движение.Количество 			= 1; 
		
		Если  Не ПроверкаВыполнена Тогда     
			Движение = Движения.КонтрольКонсернов.Добавить();   
			
			Движение.ВидДвижения 			= ВидДвиженияНакопления.Приход;
			Движение.Период 				= Дата;
			Движение.Заказ 					= Заказ;
			Движение.Консерн 				= Консерн; 
			Движение.ТребуетсяПроверка 	= Ложь;
			Движение.Количество 			= 1;   
		КонецЕсли;
		
	КонецЕсли;		
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции 
	// Код процедур и функций
#КонецОбласти


