#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТочкаРегистрации.ТолькоПросмотр = Параметры.ЗначенияЗаполнения.Свойство("ТочкаРегистрации");
	Элементы.Кампания.ТолькоПросмотр = Параметры.ЗначенияЗаполнения.Свойство("Кампания");
	Действие = ?(Запись.Установить,1,0);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.Установить = Действие = 1;
	Запись.Снять = Действие = 0;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФормулаОпределенияВозможностиВУправленииКампаниейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Формула", Запись.ФормулаОпределенияВозможностиВУправленииКампанией);
	ОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеПроверкиФормулы", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент,,,,ОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиФормулы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Запись.ФормулаОпределенияВозможностиВУправленииКампанией = РезультатЗакрытия;
	КонецЕсли;
	
КонецПроцедуры // ПослеПроверкиФормулы()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти


