
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокТипМетаданных()
КонецПроцедуры

Процедура ОбновитьСписокТипМетаданных()
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Документы", "Документ", , БиблиотекаКартинок.Документ);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Справочники", "Справочник", , БиблиотекаКартинок.Справочник);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыНакопления", "Регистр накопления", , БиблиотекаКартинок.РегистрНакопления);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыСведений", "Регистр сведений", , БиблиотекаКартинок.РегистрСведений);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Отчеты", "Отчет", , БиблиотекаКартинок.Отчет);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("Обработки", "Обработка", , БиблиотекаКартинок.Обработка);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("РегистрыБухгалтерии", "РегистрБухгалтерии", , БиблиотекаКартинок.РегистрБухгалтерии);
	Элементы.ТипМетаданных.СписокВыбора.Добавить("ОбщиеФормы", "ОбщиеФормы", , БиблиотекаКартинок.Форма);
КонецПроцедуры

&НаСервере
Процедура ТипМетаданныхПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.ТипМетаданных) Тогда
		Элементы.Метаданные.СписокВыбора.Очистить();
		Для каждого Эл Из Метаданные[Запись.ТипМетаданных] Цикл
			Элементы.Метаданные.СписокВыбора.Добавить(Эл.Имя,Эл.Синоним);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипМетаданныхПриИзменении(Элемент)
	ТипМетаданныхПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МетаданныеПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Метаданные) Тогда
		Элементы.Реквизит.СписокВыбора.Очистить();
		Для каждого Эл Из Метаданные[Запись.ТипМетаданных][Запись.Метаданные].Реквизиты Цикл
			Элементы.Реквизит.СписокВыбора.Добавить(строка(Эл.Имя),строка(Эл));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МетаданныеПриИзменении(Элемент)
	МетаданныеПриИзмененииНаСервере();
КонецПроцедуры

