
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьФормулуПрименимости(Команда)
	
	ПараметрыОткрытия = Новый Структура("ЗакрыватьПриВыборе, ФормулаПрименимости", Истина, Объект.ФормулаПрименимости);
	
	ОткрытьФорму("Справочник.ИнспектируемыеЭлементы.Форма.ФормаРедактораФормулыПрименимости", ПараметрыОткрытия, Элементы.ФормулаПрименимости, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФормулаПрименимостиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ФормулаПрименимости <> ВыбранноеЗначение Тогда
		Объект.ФормулаПрименимости = ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	Если ЗначениеЗаполнено(Объект.ФормулаПрименимости) Тогда
		Элементы.СтраницаФормулаПрименимости.Картинка = БиблиотекаКартинок.ПроизвольноеВыражение;
	Иначе
		Элементы.СтраницаФормулаПрименимости.Картинка = Новый Картинка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
