
Процедура ПередЗаписью(Отказ)
	Наименование = "";
	Наименование = Наименование+"A "+?(ЗадаватьПозициюA,"[ X ]  ","[   ]  ");
	Наименование = Наименование+"B "+?(ЗадаватьПозициюB,"[ X ]  ","[   ]  ");
	Наименование = Наименование+"C "+?(ЗадаватьПозициюC,"[ X ]","[   ]");
	
	//Если Не ЗадаватьПозициюA и не ЗадаватьПозициюB и не ЗадаватьПозициюC Тогда
	//	Отказ = Истина;
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Необходимо указать использование хотя бы одной позиции.';en='It is required to specify using of at least one position.'"));
	//КонецЕсли; 
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		Наименование = Наименование+" - "+Комментарий;
	КонецЕсли; 
	
КонецПроцедуры
