
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ФорматСообщения = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда 
		
		Сообщение = Запись.ТекстСообщения; 
		Сообщение = "<html>" + Сообщение + "</html>"; 
		
		Элементы.Сообщение.Видимость = Ложь;
		Элементы.СообщениеHTML.Видимость = Истина;	
		Элементы.ПоказатьВФорматеHTML.Видимость = Истина;
		Элементы.ПоказатьВФорматеHTML.Пометка = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВФорматеHTML(Команда)
	
	Элементы.ПоказатьВФорматеHTML.Пометка = Не Элементы.ПоказатьВФорматеHTML.Пометка;	
	Элементы.Сообщение.Видимость = Не Элементы.ПоказатьВФорматеHTML.Пометка;
	Элементы.СообщениеHTML.Видимость = Элементы.ПоказатьВФорматеHTML.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьВложенныеФайлы(Команда)
	ИмяФайла = КаталогВременныхФайлов();
	Файлы = ПосмотретьВложенныеФайлыНаСервере(ИмяФайла);
	Если Файлы.Количество() = 1 Тогда
		ИмяФайла = ИмяФайла+СокрЛП(Файлы[0].Значение.ФайлПредставление);
		Файлы[0].Значение.Файл.Записать(ИмяФайла);
		ЗапуститьПриложение(ИмяФайла);
	ИначеЕсли Файлы.Количество() > 1 Тогда
		СтруктураПараметров = новый СписокЗначений;
		Для каждого Вложение Из Файлы Цикл
			СтруктураПараметров.Добавить(Вложение.Значение.НомерФайла, Вложение.Значение.ФайлПредставление);
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Файлы", СтруктураПараметров);
		ВыбранныйФайл = ОткрытьФормуМодально("РегистрСведений.СОЛЛЕРС_ЖурналРегистрацииСобытий.Форма.ФормаВыбораФайла", ПараметрыФормы);
		
		Если ВыбранныйФайл <> Неопределено Тогда
			Для каждого Вложение Из Файлы Цикл
				Если Вложение.Значение.НомерФайла = ВыбранныйФайл Тогда
					ИмяФайла = ИмяФайла+СокрЛП(Вложение.Значение.ФайлПредставление);
					Вложение.Значение.Файл.Записать(ИмяФайла);
					ЗапуститьПриложение(ИмяФайла);
					Возврат;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;
	Иначе
		Сообщить("Вложенных файлов нет.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ПосмотретьВложенныеФайлыНаСервере(ИмяФайла)
	СписокФайлов = новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыДляОтправки.УниверсальныйНомерФайла,
		|	ФайлыДляОтправки.Файл
		|ИЗ
		|	РегистрСведений.ФайлыДляОтправки КАК ФайлыДляОтправки
		|ГДЕ
		|	ФайлыДляОтправки.ПорядковыйНомерСообщения = &ПорядковыйНомерСообщения";
	
	Запрос.УстановитьПараметр("ПорядковыйНомерСообщения", Запись.ПорядковыйНомерСообщения);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Файлы = Новый Структура("НомерФайла, ФайлПредставление, Файл");
		
		НомерФайла = ВыборкаДетальныеЗаписи.УниверсальныйНомерФайла;
		ЭлементСписка = ВыборкаДетальныеЗаписи.Файл.Получить();
		ФайлПредставление = ЭлементСписка.Представление;
		Файл = ЭлементСписка.Значение;
		Файлы.Вставить("НомерФайла",  НомерФайла);
		Файлы.Вставить("ФайлПредставление", ФайлПредставление);
		Файлы.Вставить("Файл",Файл );
		
		СписокФайлов.Добавить(Файлы);
	КонецЦикла; 
	Возврат СписокФайлов;
КонецФункции