
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьТолькоДействующие = Истина;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписоккнПоказыватьТолькоДействующие.Пометка = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДата(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоДействующиеКампании", Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура кнПоказыватьТолькоДействующие(Команда)
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписоккнПоказыватьТолькоДействующие.Пометка = Не ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписоккнПоказыватьТолькоДействующие.Пометка;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТолькоДействующиеКампании", ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.СписоккнПоказыватьТолькоДействующие.Пометка, Истина);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры
