#Область СлужебныеПроцедурыИФункции

// См. ОбменОбъектамиXDTO.ТаблицаПравилКонвертации.
//
Функция ТаблицаПравилКонвертации(ИмяМодуляПодсистемыОбмена) Экспорт
	ПравилаКонвертации = Новый ТаблицаЗначений;
	ПравилаКонвертации.Колонки.Добавить("ИмяПКО", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(50)));
	ПравилаКонвертации.Колонки.Добавить("ОбъектДанных");
	ПравилаКонвертации.Колонки.Добавить("ОбъектФормата", Новый ОписаниеТипов("Строка"));
	ПравилаКонвертации.Колонки.Добавить("Свойства", Новый ОписаниеТипов("ТаблицаЗначений"));
	ПравилаКонвертации.Колонки.Добавить("СвойстваТабличныхЧастей", Новый ОписаниеТипов("ТаблицаЗначений"));

	ОбщегоНазначения.ОбщийМодуль(ИмяМодуляПодсистемыОбмена).ЗаполнитьПравилаКонвертацииОбъектов(ПравилаКонвертации);
	
	Возврат ПравилаКонвертации;
КонецФункции

#КонецОбласти
