
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	РаботаСДиалогамиКлиент.ЗагрузкаЗаказов_ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСписком(Команда)
	РаботаСДиалогамиКлиент.ОткрытьФормуЗагрузки(ЭтаФорма, РаботаСДиалогамиКлиент.ПараметрыДляЗагрузкиЗаказов());
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусы(Команда)
	ИзменитьСтатусыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьСтатусыНаСервере()
	
	Создано = 0;
	
	Для каждого ТекСтрока Из Заказы Цикл
		
		ДокОбъект = Документы.ИзменениеСтатусаЗаказа.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.Заказ = ТекСтрока.Значение;
		ДокОбъект.Статус = Статус;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Создано = Создано + 1;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить(СтрШаблон("Создано %1 документов", Создано));
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр, ТекстСообщения) Экспорт
	Возврат ДобавитьЗаказыСпискомНаСервере(Параметр, ТекстСообщения);
КонецФункции

&НаСервере
Функция ДобавитьЗаказыСпискомНаСервере(Параметр, ТекстСообщения)
	Возврат РаботаСДиалогамиСлужебный.ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр, ТекстСообщения, ЭтаФорма);
КонецФункции

#КонецОбласти
