&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ОписаниеОбслуживания.Видимость =  Объект.ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПриЗакрытииКонсерна.Обслуживание");
	Элементы.СбросРегистрацииНаТочках.Видимость =  Объект.ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПриЗакрытииКонсерна.СбросРегистрации");
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантДействияПриИзменении(Элемент)
	
	УправлениеВидимостью();
	Если Объект.ВариантДействия = ПредопределенноеЗначение("Перечисление.ВариантыДействийПриЗакрытииКонсерна.Обслуживание") Тогда
		ОчиститьТабЧастьСбросРегистрацииНаТочках();	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

Процедура ОчиститьТабЧастьСбросРегистрацииНаТочках()

	Объект.СбросРегистрацииНаТочках.Очистить();

КонецПроцедуры


