
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоставПлана = ПланыОбмена.НетиповыеОбмены.ПустаяСсылка().Метаданные().Состав;
	
	МассивТипов = Новый Массив;
	Для Каждого ЭлементСостава Из СоставПлана Цикл
		Если Метаданные.Документы.Содержит(ЭлементСостава.Метаданные) Тогда
			МассивТипов.Добавить(Тип("ДокументСсылка."+ЭлементСостава.Метаданные.Имя));
		ИначеЕсли Метаданные.Справочники.Содержит(ЭлементСостава.Метаданные) Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка."+ЭлементСостава.Метаданные.Имя));
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ВыгружаемыйОбъект.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	//Элементы.ВыгружаемыйОбъект.ДоступныеТипы = Новый ОписаниеТипов(МассивТипов);
	
	Если Параметры.Свойство("ВидОбмена") Тогда
		Если ТипЗнч(Параметры.ВидОбмена) = Тип("СправочникСсылка.НетиповыеОбменыДанными") Тогда
			УзелРегистрацииИзменений = Параметры.ВидОбмена.УзелРегистрацииИзменений;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ВыгружаемыйОбъект") Тогда
		ВыгружаемыйОбъект = Параметры.ВыгружаемыйОбъект;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзменения(Команда)
	
	Если ВыгружаемыйОбъект.Пустая() Тогда
		ПоказатьПредупреждение(,"Не заполнен Выгружаемый объект!");
		Возврат;
	КонецЕсли;
	Если УзелРегистрацииИзменений.Пустая() Тогда
		ПоказатьПредупреждение(,"Не заполнен узел регистрации изменений");
		Возврат;
	КонецЕсли;
	
	Зарегистрировать();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура Зарегистрировать()
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелРегистрацииИзменений, ВыгружаемыйОбъект);
	
КонецПроцедуры
