#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоказателиДефектностиПоДням");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма по показателям дефектности по дням'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоказателиДефектностиПоНеделям");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма по показателям дефектности по неделям'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоказателиДефектностиПоМесяцам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма по показателям дефектности по месяцам'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПоказателиДефектностиПоГодам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма по показателям дефектности по годам'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли