
&НаКлиенте
Процедура ФормулаОпределенияПринадлежностиОпцииЗаказуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Формула", Объект.ФормулаОпределенияПринадлежностиОпцииЗаказу);
	ОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеПроверкиФормулы", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент,,,,ОповещенияОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


	
&НаКлиенте
Процедура ПослеПроверкиФормулы(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.ФормулаОпределенияПринадлежностиОпцииЗаказу = РезультатЗакрытия;
	КонецЕсли; 
	
КонецПроцедуры // ПослеПроверкиФормулы()

