Процедура КорректировкаРазмеровОтчета(TVТабло,ТабДокумент) экспорт
	//Перебор всех ячеек и установка им заданного в процентах размера, высоты и ширины
	Для текКолонка=1 По ТабДокумент.ШиринаТаблицы Цикл
		Для текСтрока=1 По ТабДокумент.ВысотаТаблицы Цикл
			ТекОбласть = ТабДокумент.Область(ТекСтрока,ТекКолонка,ТекСтрока,ТекКолонка);
			// изменение размера шрифта
			ИзмененныйШрифт = новый Шрифт(ТекОбласть.Шрифт,,ТекОбласть.Шрифт.Размер/100*TVТабло.РазмерШрифтаВПроцентах);
			ТекОбласть.Шрифт = ИзмененныйШрифт;
			// высоту для строки задаем только для первой колонки этой строки
			Если текКолонка=1 Тогда
				Если Не ТекОбласть.АвтоВысотаСтроки Тогда
					ТекОбласть.ВысотаСтроки = ТекОбласть.ВысотаСтроки/100*TVТабло.ВысотаСтрокОтчетаВПроцентах;
				КонецЕсли;
			КонецЕсли;     
			// ширину для колонки задаем только для первой строки этой колонки
			Если текСтрока=1 Тогда
				ТекОбласть.ШиринаКолонки = ТекОбласть.ШиринаКолонки/100*TVТабло.ШиринаКолонокОтчетаВПроцентах;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
 
