
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	РаботаСДиалогамиКлиент.ЗагрузкаЗаказов_ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма);	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКонсёрны(Команда)
	СоздатьКонсёрныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписком(Команда)	
	РаботаСДиалогамиКлиент.ОткрытьФормуЗагрузки(ЭтаФорма, РаботаСДиалогамиКлиент.ПараметрыДляЗагрузкиЗаказов());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьКонсёрныНаСервере()
	
	Создано = 0;
	
	Для каждого ТекСтрока Из Заказы Цикл
		
		ДокОбъект = Документы.ОперацияПоКачеству.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.ОперацияКачества = Перечисления.ОперацииКачества.Проверка;
		ДокОбъект.Заказ = ТекСтрока.Значение;
		ДокОбъект.ИнспектируемыйЭлемент = ИнспектируемыйЭлемент;
		ДокОбъект.ВариантИспользованияИнспектируемогоЭлемента = ВариантИспользованияИнспектируемогоЭлемента;
		ДокОбъект.ТочкаПроверкиКачества = ТочкаПроверкиКачества;
		ДокОбъект.Дефект = Дефект;
		ДокОбъект.ПозицияА = ПозицияA;
		ДокОбъект.ПозицияB = ПозицияB;
		ДокОбъект.ПозицияC = ПозицияC;
		ДокОбъект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		ДокОбъект.АвторДата = ТекущаяДатаСеанса();
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Создано = Создано + 1;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить(СтрШаблон("Создано %1 документов", Создано));
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр, ТекстСообщения) Экспорт
	Возврат ДобавитьЗаказыСпискомНаСервере(Параметр, ТекстСообщения);
КонецФункции

&НаСервере
Функция ДобавитьЗаказыСпискомНаСервере(Параметр, ТекстСообщения)
	Возврат РаботаСДиалогамиСлужебный.ДобавитьЗаказыСписком_ОбработкаОповещения(Параметр, ТекстСообщения, ЭтаФорма);
КонецФункции

#КонецОбласти
