
#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вставить содержимое обработчика.
	ЗначениеДляСравнения = ПредопределенноеЗначение("Справочник.ГруппыВариантовПозицииС.ПустаяСсылка");
	
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда 
		ЗначениеДляСравнения = Элемент.ТекущаяСтрока;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СправочникВариантыПозицииC,
	"Владелец", ЗначениеДляСравнения,
	ВидСравненияКомпоновкиДанных.Равно, , Истина,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный,
	)
	
КонецПроцедуры

#КонецОбласти

