
&НаКлиенте
Процедура УстановитьСнятьПометкуПоУмолчанию(Команда)
	КонтрольнаяМетка = Элементы.Список.ТекущаяСтрока;
	Если КонтрольнаяМетка <> Неопределено Тогда
		 УстановитьСнятьПометкуПоУмолчаниюНаСервере(КонтрольнаяМетка);
		 Элементы.Список.Обновить();
	 Иначе
		 Предупреждение(НСтр("ru='Выберите строку';en='Choose a line'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьПометкуПоУмолчаниюНаСервере(КонтрольнаяМетка)
    ПометкаИспользоватьПоУмолчанию = Не КонтрольнаяМетка.ИспользоватьПоУмолчанию;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольныеМетки.Ссылка
		|ИЗ
		|	Справочник.КонтрольныеМетки КАК КонтрольныеМетки
		|ГДЕ
		|	КонтрольныеМетки.РеквизитЗаказа = &РеквизитЗаказа";

	Запрос.УстановитьПараметр("РеквизитЗаказа", КонтрольнаяМетка.РеквизитЗаказа);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КонМетка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КонМетка.ИспользоватьПоУмолчанию = ПометкаИспользоватьПоУмолчанию;
		КонМетка.ОбменДанными.Загрузка = Истина;
		КонМетка.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна(Метаданные.Роли.ПолныеПрава) или РольДоступна(Метаданные.Роли.АдминистраторСистемы) Тогда
		Элементы.УстановитьСнятьПометкуПоУмолчанию.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
