
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ФактРегистрацииЗаказаДляКонтроляПрохожденияОбязательныхТочек
	Движения.ФактРегистрацииЗаказаДляКонтроляПрохожденияОбязательныхТочек.Записывать = Истина;
	Движение = Движения.ФактРегистрацииЗаказаДляКонтроляПрохожденияОбязательныхТочек.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.ТочкаПроверкиКачества = ТочкаПроверкиКачества;
	Движение.Выполнена = Истина;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
