#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АнализируемыйПериодСрабатыванияТресхолда = ВернутьВариантАнализируемогоПериодаИзХраненияЗначения(Объект);
	Вариант = АнализируемыйПериодСрабатыванияТресхолда.Вариант;
	
	ВосстановитьДатыАнализируемогоПериодаСрабатыванияТресхолда(Вариант);
	ВидимостьДатАнализируемогоПериодаСрабатыванияТресхолда(Вариант);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(АнализируемыйПериодСрабатыванияТресхолда) Тогда
		
		ТекущийОбъект.ВариантАнализируемогоПериода = Новый ХранилищеЗначения(АнализируемыйПериодСрабатыванияТресхолда.Вариант);
		
		Если СлужебныеПроцедурыФункции.ПроизвольныйЛиВариантУАнализируемогоПериода(АнализируемыйПериодСрабатыванияТресхолда.Вариант) Тогда
			ТекущийОбъект.ДатаНачала = АнализируемыйПериодСрабатыванияТресхолда.ДатаНачала;
			ТекущийОбъект.ДатаОкончания = АнализируемыйПериодСрабатыванияТресхолда.ДатаОкончания;
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АнализируемыйПериодСрабатыванияТресхолдаВариантПриИзменении(Элемент)
	
	Если СлужебныеПроцедурыФункции.ПроизвольныйЛиВариантУАнализируемогоПериода(АнализируемыйПериодСрабатыванияТресхолда.Вариант) Тогда
		Объект.ДатаНачала = АнализируемыйПериодСрабатыванияТресхолда.ДатаНачала;
		Объект.ДатаОкончания = АнализируемыйПериодСрабатыванияТресхолда.ДатаОкончания;
	КонецЕсли;
	ВидимостьДатАнализируемогоПериодаСрабатыванияТресхолда(АнализируемыйПериодСрабатыванияТресхолда.Вариант);
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьДатАнализируемогоПериодаСрабатыванияТресхолда(ВариантАнализируемогоПериода)
	
	Элементы.АнализируемыйПериодСрабатыванияТресхолдаДатаНачала.Видимость = СлужебныеПроцедурыФункции.ПроизвольныйЛиВариантУАнализируемогоПериода(ВариантАнализируемогоПериода);
	Элементы.АнализируемыйПериодСрабатыванияТресхолдаДатаОкончания.Видимость = СлужебныеПроцедурыФункции.ПроизвольныйЛиВариантУАнализируемогоПериода(ВариантАнализируемогоПериода);
	
КонецПроцедуры

&НаСервере
Функция ВернутьВариантАнализируемогоПериодаИзХраненияЗначения(ХранилищеВарианта)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ВариантАнализируемогоПериода = Новый СтандартныйПериод();
	
	Вариант = ТекущийОбъект.ВариантАнализируемогоПериода.Получить(); //Может быть незаполнен (наприме, новый объект)
	Если Вариант <> Неопределено Тогда
		ВариантАнализируемогоПериода = Новый СтандартныйПериод(Вариант);	
	КонецЕсли;
	
	Возврат ВариантАнализируемогоПериода;
КонецФункции

&НаСервере
Процедура ВосстановитьДатыАнализируемогоПериодаСрабатыванияТресхолда(Вариант)
	
	Если СлужебныеПроцедурыФункции.ПроизвольныйЛиВариантУАнализируемогоПериода(Вариант) Тогда
		АнализируемыйПериодСрабатыванияТресхолда.ДатаНачала = Объект.ДатаНачала;
		АнализируемыйПериодСрабатыванияТресхолда.ДатаОкончания = Объект.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	
//	ПроверяемыеРеквизиты.Добавить("АнализируемыйПериодСрабатыванияТресхолдаВариант");
//	ПроверяемыеРеквизиты.Добавить("АнализируемыйПериодСрабатыванияТресхолдаДатаНачала");
//	
//КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Проверка заполнения Варианта и ДатыНачала
	//Тресхолд может действовать вечно, поэтому дата проверки окончания не обязательна
	//Данные по нему будут считаться с даты начала
	Если НЕ ЗначениеЗаполнено(АнализируемыйПериодСрабатыванияТресхолда.Вариант) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен вариант анализируемого периода";
		Сообщение.Поле = "АнализируемыйПериодСрабатыванияТресхолда.Вариант";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АнализируемыйПериодСрабатыванияТресхолда.ДатаНачала) Тогда
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена дата начала анализируемого периода";
		Сообщение.Поле = "АнализируемыйПериодСрабатыванияТресхолда.ДатаНачала";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить(); 
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти	
