
&НаКлиенте
Процедура ФормулаДляОтвета_НеНайденVINНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Формула,ТипРезультата", Объект.ФормулаДляОтвета_НеНайденVIN, Новый ОписаниеТипов("Строка"));
	ПараметрыОповещения = Новый Структура("ФормулаДляОтвета_НеНайденVIN", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьФормулуДляОтвета", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаДляОтвета_ACKНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Формула,ТипРезультата", Объект.ФормулаДляОтвета_ACK, Новый ОписаниеТипов("Строка"));
	ПараметрыОповещения = Новый Структура("ФормулаДляОтвета_ACK", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьФормулуДляОтвета", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаДляОтвета_NAKНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Формула,ТипРезультата", Объект.ФормулаДляОтвета_NAK,Новый ОписаниеТипов("Строка"));
	ПараметрыОповещения = Новый Структура("ФормулаДляОтвета_NAK", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьФормулуДляОтвета", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ФормулаДляОшибкиВоВходящихДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Формула,ТипРезультата", Объект.ФормулаДляОтвета_NAK,Новый ОписаниеТипов("Строка"));
	ПараметрыОповещения = Новый Структура("ФормулаДляОтвета_WrongData", Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьФормулуДляОтвета", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.ОтладкаФормул.Форма", ПараметрыФормы, Элемент, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьФормулуДляОтвета(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	Если РезультатЗакрытия <> Неопределено Тогда
		Если ДополнительныеПараметры.Свойство("ФормулаДляОтвета_НеНайденVIN") Тогда
			Объект.ФормулаДляОтвета_НеНайденVIN = РезультатЗакрытия;
		ИначеЕсли ДополнительныеПараметры.Свойство("ФормулаДляОтвета_ACK") Тогда
			Объект.ФормулаДляОтвета_ACK = РезультатЗакрытия;
		ИначеЕсли ДополнительныеПараметры.Свойство("ФормулаДляОтвета_NAK") Тогда
			Объект.ФормулаДляОтвета_NAK = РезультатЗакрытия;
		ИначеЕсли ДополнительныеПараметры.Свойство("ФормулаДляОтвета_WrongData") Тогда
			Объект.ФормулаДляОтвета_NAK = РезультатЗакрытия;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

