
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	
	ПараметрТоп = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Топ");
	ЗначениеПараметраПользователяТоп = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрТоп.ИдентификаторПользовательскойНастройки).Значение;
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 5", "ПЕРВЫЕ " + ЗначениеПараметраПользователяТоп);

КонецПроцедуры
