#Область ПрограммныйИнтерфейс

// @skip-warning
// Описание
// 
// Параметры:
// 	ИсходныйНТТРЗапрос - HTTPСервисЗапрос - 
// Возвращаемое значение:
// 	ОбработкаОбъект.ВебПриложение_НТТРЗапрос - Описание
Функция НовыйНТТРЗапрос(ИсходныйНТТРЗапрос) Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

// @skip-warning
// Описание
// 
// Возвращаемое значение:
// 	ОбработкаОбъект.ВебПриложение_НТТРОтвет - Описание
Функция НовыйНТТРОтвет() Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

// @skip-warning
// Описание
// 
// Параметры:
// 	Запрос - ОбработкаОбъект.ВебПриложение_НТТРЗапрос - 
// 	Ответ - ОбработкаОбъект.ВебПриложение_НТТРОтвет -
// 	ПараметрыРазбора - Структура -
// Возвращаемое значение:
// 	Произвольный - Описание
Функция РазобратьТело(Запрос, Ответ, ПараметрыРазбора) Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

// @skip-warning
// Описание
// 
// Возвращаемое значение:
// 	ОбработкаОбъект.ВебПриложение_Заголовки - Описание
Функция ОбработкаЗаголовков() Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

// @skip-warning
// Описание
// 
// Параметры:
// 	Запрос - ОбработкаОбъект.ВебПриложение_НТТРЗапрос - 
// 	Ответ - ОбработкаОбъект.ВебПриложение_НТТРОтвет -
// Возвращаемое значение:
// 	ОбработкаОбъект.ВебПриложение_Логирование - Описание
Функция ЗаписатьВЖурнал(Запрос, Ответ) Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

// @skip-warning
// Описание
// 
// Параметры:
// 	Статус - Число - код статуса, по умолчанию 500
// 	Сообщение - Строка, ИнформацияОбОшибке - сообщение об ошибке
// 	ДополнительныеСвойства - Структура - дополнительные сведения об ошибке:
//   * Раскрывать - Булево - если Истина, тогда сообщение об ошибке отправляется клиенту. Для ошибок >=500 по умолчанию Ложь
//   * Заголовки - Соответствие, Неопределено - объект с заголовками, отправляемыми клиенту
// Возвращаемое значение:
// 	ОбработкаОбъект.ВебПриложение_Ошибка - Описание
Функция НовыйОшибка(Статус = 500, Сообщение = "", ДополнительныеСвойства = Неопределено) Экспорт
	ВызватьИсключение НСтр("ru = 'Нереализованный метод'");
КонецФункции

#КонецОбласти