#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КоличествоДефектовПоДням");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма количество дефектов по дням'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КоличествоДефектовПоНеделям");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма количество дефектов по неделям'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КоличествоДефектовПоМесяцам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма количество дефектов по месяцам'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КоличествоДефектовПоГодам");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма количество дефектов по годам'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли