
Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольныеМетки.ИспользоватьПоУмолчанию
		|ИЗ
		|	Справочник.КонтрольныеМетки КАК КонтрольныеМетки
		|ГДЕ
		|	КонтрольныеМетки.РеквизитЗаказа = &РеквизитЗаказа
		|	И КонтрольныеМетки.Ссылка <> &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрольныеМетки.ИспользоватьПоУмолчанию";

	Запрос.УстановитьПараметр("РеквизитЗаказа", РеквизитЗаказа);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИспользоватьПоУмолчанию = ВыборкаДетальныеЗаписи.ИспользоватьПоУмолчанию;
	КонецЦикла;
КонецПроцедуры

