////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)

 Результат = СформироватьОтчетПоУровнюДефектности_Сервер(Отчет.ВариантОтчета,ДатаОтчета);	
 
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция СформироватьОтчетПоУровнюДефектности_Сервер(ВариантОтчета,ДатаОтчета)
	Перем ТекстОшибки;
	Результат = "";
	Результат = Отчеты.ОтчетFTT.СформироватьОтчет(ВариантОтчета,ДатаОтчета,ТекстОшибки);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда 
		Результат = ТекстОшибки
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
