#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЕжедневныйАнализДефектов");
	НастройкиВарианта.Описание = НСтр("ru = 'Ежедневный отчет по дефектам'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли