#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#Область Настройки

Процедура ЗаполнитьНастройкиПриложения(Сессия, ПараметрыЗапросаКлиента, ПараметрыОтветаКлиенту) Экспорт	
	ПараметрыОтветаКлиенту = Новый Структура;
	ПараметрыОтветаКлиенту.Вставить("user", "");
	ПараметрыОтветаКлиенту.Вставить("languageCode", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());//ПолучитьКодЯзыкаТекущегоПользователя());
	ПараметрыОтветаКлиенту.Вставить("endScanCharCode", МобильныеВебИнтерфейсыСервер.ПолучитьКодСимволаОкончанияСканирования());	
	ПараметрыОтветаКлиенту.Вставить("preloaderDelay", 0);
	ПараметрыОтветаКлиенту.Вставить("debugMode", Ложь); // больше не используется 
	//ПараметрыОтветаКлиенту.Вставить("fontSize", 0); // пока не используется
	ПараметрыОтветаКлиенту.Вставить("error", Ложь);
	ПараметрыОтветаКлиенту.Вставить("errorMess", "");
	ПараметрыОтветаКлиенту.Вставить("minimalWindowSize", 0); //SCR 000000365 Кочемасов М.П.
	//
	//ОсновнойВебИнтерфейс = МобильныеВебИнтерфейсыСервер.ПолучитьОсновнойВебИнтерфейс(); //SCR 000000365 Кочемасов М.П.
	//
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	//Запрос.УстановитьПараметр("ОсновнойВебИнтерфейс", ОсновнойВебИнтерфейс);
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	МобильныеИнтерфейсы.МинимальнаяЗадержкаСтраницыЗагрузки КАК МинимальнаяЗадержкаСтраницыЗагрузки,
	//|	ЕСТЬNULL(Пользователи.Наименование, """") КАК ИмяПользователя,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(Пользователи.ТипПользователя, ЗНАЧЕНИЕ(Перечисление.ТипыПользователей.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыПользователей.Generic)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК IsGeneric
	//|ИЗ
	//|	Справочник.МобильныеИнтерфейсы КАК МобильныеИнтерфейсы
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	//|		ПО (Пользователи.Ссылка = &ТекущийПользователь)
	//|ГДЕ
	//|	МобильныеИнтерфейсы.Ссылка = &ОсновнойВебИнтерфейс";
	//Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	Возврат;	
	//КонецЕсли;
	//
	//Выборка = Результат.Выбрать();
	//Выборка.Следующий();
	//Если (Выборка.IsGeneric) Тогда 
	//	ПараметрыОтветаКлиенту.user = СокрЛП(Выборка.ИмяПользователя);
	//Иначе
	//	ПараметрыОтветаКлиенту.user = ФизическиеЛицаКлиентСервер.ФамилияИнициалыФизЛица(СокрЛП(Выборка.ИмяПользователя));
	//КонецЕсли;
	//ПараметрыОтветаКлиенту.preloaderDelay = Выборка.МинимальнаяЗадержкаСтраницыЗагрузки;
	//
	//ПараметрыОтветаКлиенту.minimalWindowSize = Справочники.МобильныеИнтерфейсы.ПолучитьПрикладнуюНастройку(ОсновнойВебИнтерфейс, "МинимальныйРазмерСтороныДляПереходаВКомпактныйРежим"); //SCR 000000365 Кочемасов М.П.
	//
КонецПроцедуры

#КонецОбласти
