
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ЭтотОбъект Цикл
		
		Если ТекСтрока.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюA И Не ЗначениеЗаполнено(ТекСтрока.ЗначениеВариантаПозицийA) Тогда
			//Отказ = Истина;
		КонецЕсли;
		
		Если ТекСтрока.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюB И Не ЗначениеЗаполнено(ТекСтрока.ЗначениеВариантаПозицийB) Тогда
			//Отказ = Истина;
		КонецЕсли;
		
		Если ТекСтрока.ВариантИспользованияИнспектируемогоЭлементаНаИзображении.ЗадаватьПозициюC И Не ЗначениеЗаполнено(ТекСтрока.ЗначениеВариантаПозицийC) Тогда
			//Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
