&НаКлиенте
Процедура СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчаниюПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ИнтерфейсПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РабочееМестоОператора") Тогда
			ЭлементОтбора.Использование = Истина;
			ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
		Иначе
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

	//Элементы.ГруппаQNS.Видимость = Объект.ТипИнтерфейса = ПредопределенноеЗначение("Перечисление.ИнтерфейсыОператоров.QLS"); 
	//Элементы.СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчанию.Видимость = (Объект.ТипИнтерфейса = ПредопределенноеЗначение("Перечисление.ИнтерфейсыОператоров.QLS"));
	
	Если ЗначениеЗаполнено(Объект.ТипИнтерфейса)  Тогда
		Элементы.ГруппаQNS.Видимость = Истина; 
		Элементы.СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчанию.Видимость = Истина;
	Иначе
		Элементы.ГруппаQNS.Видимость = Ложь; 
		Элементы.СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчанию.Видимость = Ложь;
	КонецЕсли;

	Элементы.ЖурналНазначений.Видимость = Элементы.ТекущиеНазначенияОператоров.Видимость;
	
	Элементы.ГруппаКонтрольныхМеток.Видимость = Объект.СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчанию;
	Если Объект.СканированиеПредусмотреноПоРеквизитамОтличныхОтЗаданныхПоУмолчанию Тогда
		ЗаполнитьСписокВыбораРеквизитовКонтрольныхМеток();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораРеквизитовКонтрольныхМеток()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольныеМетки.РеквизитЗаказа
		|ИЗ
		|	Справочник.КонтрольныеМетки КАК КонтрольныеМетки
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрольныеМетки.РеквизитЗаказа";
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.КонтрольныеМеткиРеквизитКонтрольнойМетки.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.РеквизитЗаказа);
	КонецЦикла;
КонецПроцедуры



