#Область ПрограммныйИнтерфейс

Функция ШаблоныСообщений() Экспорт

	Шаблоны = Новый Структура();
	Шаблоны.Вставить("Тип", НСтр("ru = 'Поле ''[Поле]'': значение ''[Значение] не соответствует типу ''[ДополнительноеЗначение]'''; 
		|en = 'The ''[Поле]'': value ''[Значение] does not match type ''[ДополнительноеЗначение]'''"));
	Шаблоны.Вставить("Обязательное", НСтр("ru = 'Поле ''[Поле]'' не заполнено'; en = 'The ''[Поле]'' field is required'")); 
	Шаблоны.Вставить("ВСписке", НСтр("ru = 'Поле ''[Поле]'': значения ''[Значение]'' нет в списке доступных: [ДополнительноеЗначение]';
		|en = 'The field ''[Поле]'': value ''[Значение]'' is not in the list of available: [ДополнительноеЗначение]'"));
	Шаблоны.Вставить("Равно", НСтр("ru = 'Поле ''[Поле]'': значения должно быть равно: [ДополнительноеЗначение]';
		|en = 'The field ''[Поле]'': value value must be: [ДополнительноеЗначение]'"));

	// Строка
	Шаблоны.Вставить("СтрокаПустая", НСтр("ru = 'Поле ''[Поле]'' должно быть непустой строкой';
		|en = 'The field ''[Поле]'' must be a non-empty string'"));
	
	Возврат Шаблоны;
	
КонецФункции

#КонецОбласти
