Функция ПолучитьПоследнююНастройкуОбменаКотораяЕщеНеПринята(ОбменДанными,СсылкаАнализируемыйДокумент)

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИзменениеНастроекОбмена.Ссылка
		|ИЗ
		|	Документ.ИзменениеНастроекОбмена КАК ИзменениеНастроекОбмена
		|ГДЕ
		|	НЕ ИзменениеНастроекОбмена.ПометкаУдаления
		|	И (НЕ ИзменениеНастроекОбмена.Проведен
		|			ИЛИ ИзменениеНастроекОбмена.Ссылка = &Ссылка)
		|	И ИзменениеНастроекОбмена.СсылкаНаОбменДанными = &ОбменДанными
		|	И НЕ ИзменениеНастроекОбмена.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзменениеНастроекОбмена.Дата УБЫВ,
		|	ИзменениеНастроекОбмена.Номер УБЫВ";

	Запрос.УстановитьПараметр("ОбменДанными", ОбменДанными);
	Запрос.УстановитьПараметр("Ссылка", СсылкаАнализируемыйДокумент);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Возврат Неопределено;


КонецФункции // ПолучитьПоследнююНастройкуОбменаКотораяЕщеНеПринята()

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПоследняяНастройкаОбменаКотораяЕщеНеПринята = ПолучитьПоследнююНастройкуОбменаКотораяЕщеНеПринята(СсылкаНаОбменДанными,Ссылка);
	
	Если ПоследняяНастройкаОбменаКотораяЕщеНеПринята <> Неопределено и ПоследняяНастройкаОбменаКотораяЕщеНеПринята <> Ссылка Тогда
		Сообщить("Данный настройка обмена уже неактуальна, существует более поздняя не принятая настройка.");
		Отказ = Истина;
	КонецЕсли;
	
	Если ЭтоОбщиеНастройкиОбменов Тогда
		АктуальныйДокНастройки = Константы.ПоследнийДокументИзмененияОбщихНастроекОбменов.Получить();
	Иначе
		АктуальныйДокНастройки = СсылкаНаОбменДанными.ПоследнийДокументИзмененияНастройкиОбмена;
	КонецЕсли;     
	
	Если ЗначениеЗаполнено(АктуальныйДокНастройки) и ((Дата<АктуальныйДокНастройки.Дата) или Дата=АктуальныйДокНастройки.Дата и Номер<АктуальныйДокНастройки.Номер)  Тогда
		Сообщить("Данный настройка обмена уже неактуальна, существует более поздняя принятая настройка.");
		Отказ = Истина;
	КонецЕсли;
	
	
	ТекстОшибки = "";
	РаботасОбменомДанными.ПолучитьДанныеXML_ExchangeSettings(НастройкиОбмена,ТекстОшибки);
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
	
		Отказ = Истина;
		Сообщить("Ошибка проверки структуры XML файла:"+Символы.ПС+ТекстОшибки);
	
	КонецЕсли;
	Если ЭтоОбщиеНастройкиОбменов Тогда
		Константы.ПоследнийДокументИзмененияОбщихНастроекОбменов.Установить(Ссылка);
		Константы.ОбщиеНастройкиОбменов.Установить(НастройкиОбмена);
	Иначе
		СпрОбъект = СсылкаНаОбменДанными.ПолучитьОбъект();
		СпрОбъект.НастройкиОбмена = НастройкиОбмена;
		СпрОбъект.ПоследнийДокументИзмененияНастройкиОбмена = Ссылка;
		СпрОбъект.Записать();
	КонецЕсли;
КонецПроцедуры
