#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТопДефектовЗаПериод");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет-диаграмма топ дефектов за период'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли