&НаКлиенте
Процедура УправлениеВидимостью_Доступностью()
	
	ЭтоПроверка = Ложь;
	ЭтоРемонт = Ложь;
	ЭтоКонтроль = Ложь;
	
	Если Объект.ОперацияКачества = ПредопределенноеЗначение("Перечисление.ОперацииКачества.Проверка") Тогда
		ЭтоПроверка = Истина;
	ИначеЕсли Объект.ОперацияКачества = ПредопределенноеЗначение("Перечисление.ОперацииКачества.Контроль") Тогда
		ЭтоКонтроль = Истина;
	Иначе
		ЭтоРемонт = Истина;
	КонецЕсли; 
	
	Элементы.OK.Видимость = ЭтоПроверка Или ЭтоКонтроль;
	Элементы.группаИнспектируемыйЭлемент.ТолькоПросмотр = ЭтоРемонт Или ЭтоКонтроль;
	Элементы.ХарактеристикиДефекта.ТолькоПросмотр = ЭтоРемонт Или ЭтоКонтроль;
	Элементы.ХарактеристикиДефекта.Видимость = Не Объект.ПроверкаOK;
	Элементы.ДокументКонсерна.Видимость = ЭтоРемонт Или ЭтоКонтроль;
	Элементы.ДействияПриЗакрытииКонсерна.Видимость = ЭтоРемонт или  Объект.ОперацияКачества = ПредопределенноеЗначение("Перечисление.ОперацииКачества.Проверка") и Объект.Отремонтирован;
	Элементы.Отремонтирован.Видимость = ЭтоПроверка;
	Элементы.Замена.Видимость = ЭтоРемонт;
	Элементы.Демонтаж.Видимость = ЭтоРемонт;
	Элементы.Источник.Видимость = ЭтоПроверка Или ЭтоРемонт;
	
	//Если ЭтоКонтроль Тогда
	//	Элементы.ТочкаРегистрации.Видимость = Ложь;
	//	Элементы.группаИнспектируемыйЭлемент.Видимость = Ложь;
	//	Элементы.ХарактеристикиДефекта.Видимость = Ложь;
	//	Элементы.Демонтаж.Видимость = Ложь;
	//	Элементы.Замена.Видимость = Ложь;
	//	Элементы.Комментарий.Видимость = Ложь;
	//	Элементы.ДействияПриЗакрытииКонсерна.Видимость = Ложь;
	//	Элементы.Смена.Видимость = Ложь;
	//	Элементы.Ответственный.Видимость = Ложь;
	//	Элементы.Источник.Видимость = Ложь;
	//Иначе 
	//	Элементы.ТочкаРегистрации.Видимость = Истина;
	//	Элементы.Комментарий.Видимость = Истина;
	//	Элементы.Смена.Видимость = Истина;
	//	Элементы.Ответственный.Видимость = Истина;
	//	Элементы.Источник.Видимость = Истина;
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью_Доступностью();
КонецПроцедуры


&НаКлиенте
Процедура OKПриИзменении(Элемент)
	УправлениеВидимостью_Доступностью();
КонецПроцедуры


&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УправлениеВидимостью_Доступностью();
КонецПроцедуры
 