#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли; 
	
	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если СпособИдентификацииЗаказа = Перечисления.СпособыИдентификацииЗаказа.АвтоматическаяПроверка Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ИнспектируемыеЭлементыДляАвтоматическогоЗанесенияКонсернов");
		
	КонецЕсли; 
 
	Если СпособИдентификацииЗаказа = Перечисления.СпособыИдентификацииЗаказа.ВыборСледующегоЗаказаИзОчереди Тогда
		ПроверяемыеРеквизиты.Добавить("ТочкаРегистрацииДляОпределенияСледующегоЗаказа");
	КонецЕсли; 
	
	Если Не ПоказыватьВсеДефекты Тогда
		ПроверяемыеРеквизиты.Добавить("Дефекты");
	КонецЕсли;
	
	Если Не ПоказыватьВсеИнспектируемыеЭлементы Тогда
		ПроверяемыеРеквизиты.Добавить("ИнспектируемыеЭлементы");
	КонецЕсли;

	//Если КонтролироватьПрохождениеОбязательныхТочек и (ОбязательныеТочкиПроверкиКачества.Количество()=0 и ОбязательныеТочкиРегистрации.Количество()=0) Тогда
	//	ПроверяемыеРеквизиты.Добавить("ОбязательныеТочкиПроверкиКачества");
	//	ПроверяемыеРеквизиты.Добавить("ОбязательныеТочкиРегистрации");
	//КонецЕсли; 
		
	//Если КонтролироватьСледующиеДефекты Тогда
	//	ПроверяемыеРеквизиты.Добавить("КонтролируемыеДефекты");	
	//КонецЕсли;    
	
	Если АктивироватьВкладкуКонтроль Тогда
		ПроверяемыеРеквизиты.Добавить("ПулИнспектируемыхЭлементовДляКонтроля");	
	КонецЕсли; 
	
	//Если КонтролироватьСледующийРемонт Тогда
	//	ПроверяемыеРеквизиты.Добавить("КонтролируемыйРемонт");
	//КонецЕсли;
	
	//Если КонтролироватьНаличиеКампаний и (КонтролируемыеТипыКампании.Количество() = 0 и КонтролируемыеКампании.Количество() = 0) Тогда
	//	ПроверяемыеРеквизиты.Добавить("КонтролируемыеТипыКампании");
	//	ПроверяемыеРеквизиты.Добавить("КонтролируемыеКампании");
	//КонецЕсли;
	
	Если ЗакрыватьКампанииИзСписка Тогда
		ПроверяемыеРеквизиты.Добавить("КампанииДоступныеДляЗакрытия");
	КонецЕсли;
	
	Если СпособОткрытияКонсернаПоКартинке Тогда
		ПроверяемыеРеквизиты.Добавить("ИнспектируемыеЭлементыПоИзображениям");
	КонецЕсли;      
	
	Если ТипИнтерфейса = Перечисления.ИнтерфейсыОператоров.Инспектор Тогда
		ПроверяемыеРеквизиты.Добавить("ИнспектируемыеЭлементы.ВариантИспользованияИнспектируемогоЭлемента");
	КонецЕсли;          
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);   
	
	Если ЭтотОбъект.КонтролироватьВыполненныйРемонт И Не ЭтотОбъект.АктивироватьВкладкуКонтроль Тогда
		ОбщегоНазначения.СообщитьПользователю("Контроль выполненного ремонта может быть установлен только с активированной вкладкой ""Контроль""",ЭтотОбъект,"КонтролироватьВыполненныйРемонт");	
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
