
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр Кампании Приход
	Движения.Кампании.Записывать = Истина;
	Движение = Движения.Кампании.Добавить();
	Движение.ВидДвижения = ?(ОперацияКампании=Перечисления.ОперацииКампании.Установка,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Кампания = Кампания;
	Движение.Количество = 1;
	
	Движения.Записать();
	
	Если ОперацияКампании=Перечисления.ОперацииКампании.Снятие Тогда
		Движения.Записать();
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КампанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Кампании.Остатки(
		|			,
		|			Заказ = &Заказ
		|				И Кампания = &Кампания) КАК КампанииОстатки
		|ГДЕ
		|	КампанииОстатки.КоличествоОстаток < 0";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);
		Запрос.УстановитьПараметр("Кампания", Кампания);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
			ВызватьИсключение НСтр("ru='Невозможно снять заказ ';en='Unable to remove the order '")+Заказ+НСтр("ru='с кампании ';en='from the campaign '")+Кампания+НСтр("ru=' так как заказ не был на нее поставлен.';en=' as order was not put to it.'");
		КонецЕсли; 
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КампанииОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Кампании.Остатки(
		|			,
		|			Заказ = &Заказ
		|				И Кампания = &Кампания) КАК КампанииОстатки
		|ГДЕ
		|	КампанииОстатки.КоличествоОстаток > 1";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);
		Запрос.УстановитьПараметр("Кампания", Кампания);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
			ВызватьИсключение НСтр("ru='Невозможно поставить заказ ';en='Unable to set the order '")+Заказ+НСтр("ru=' на кампанию ';en=' on the campaign '")+Кампания+НСтр("ru=', так как заказ уже был на нее поставлен.';en=' as order was already set on it.'");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
