
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.СтатусыЗаказов.Записывать = Истина;
	Движение = Движения.СтатусыЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Заказ = Заказ;
	Движение.Статус = Статус;
	
	МассивОбменов = Справочники.НетиповыеОбменыДанными.ПолучитьОбменыПоИмениОбработки(
		Метаданные.Обработки.QLS_STATUSES_UNLOAD.Имя);
	Для каждого ВидВыгрузкиДанных Из МассивОбменов Цикл
		НетиповыеОбмены.ЗарегистрироватьИзмененияОбъектаВПланеОбмена(Ссылка, ВидВыгрузкиДанных);
	КонецЦикла;	

КонецПроцедуры
