
Функция ЕстьVBOM_Повт(Заказ, КодыНоменклатур) экспорт
	
	ТекстОшибки = "";
	МассивКодыНоменклатур = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СТРОКА(КодыНоменклатур),";");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	VBOM.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.VBOM КАК VBOM
		|ГДЕ
		|	VBOM.Заказ = &Заказ
		|	И VBOM.Номенклатура.КодЗавода В(&КодыНоменклатур)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("КодыНоменклатур", МассивКодыНоменклатур);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 

КонецФункции

Функция ЕстьНекомплект_Повт(Заказ, НоменклатураИмя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НекомплектыОстатки.Заказ,
		|	НекомплектыОстатки.Номенклатура,
		|	НекомплектыОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.Некомплекты.Остатки(
		|			,
		|			Заказ = &Заказ
		|				&Некомплект) КАК НекомплектыОстатки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);	
	Если НоменклатураИмя <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Некомплект","И Номенклатура.Наименование = &Некомплект");
		Запрос.УстановитьПараметр("Некомплект", НоменклатураИмя);	
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&Некомплект","");
	КонецЕсли;
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
		
КонецФункции
