#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр НазначенияРабочихМестОператорам
	Движения.НазначенияРабочихМестОператорам.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаДокумента Из ТаблицаДокумента Цикл
		Движение = Движения.НазначенияРабочихМестОператорам.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = ТекСтрокаТаблицаДокумента.Пользователь;
		Движение.РабочееМестоОператора = ТекСтрокаТаблицаДокумента.РабочееМестоОператора;
		Движение.Отключено = ТекСтрокаТаблицаДокумента.Отключено;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти
