#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Сериализовать(Значение, Параметры = Неопределено) Экспорт
	Возврат СериализацияСервер.ЗначениеВСтрокуXML(Значение);	
КонецФункции

Функция Десериализовать(Строка, ТипXDTO = Неопределено, Параметры = Неопределено) Экспорт
	Если ТипXDTO = Неопределено Тогда
		Возврат СериализацияСервер.СтрокаXMLВЗначение(Строка);
	Иначе
		Возврат СериализацияСервер.СтрокаXMLВЗначениеXDTO(Строка, ТипXDTO);
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли