
&НаКлиенте
Процедура ТипПоказателяПриИзменении(Элемент)
	Объект.ВидПоказателя = "";
	Объект.ТочкиПроверкиКачества.Очистить();
	Объект.ТочкиРегистрации.Очистить();
	Объект.Показатели.Очистить();
	
	УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//УправлениеВидимостью();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	Элементы.ВидПоказателя.Видимость = Объект.ТипПоказателя = 0;
	Элементы.ГруппаТочкиПроверкиКачества.Видимость = Объект.ТипПоказателя = 0;
	Элементы.ГруппаТочкиРегистрации.Видимость = Объект.ТипПоказателя = 0;
	Элементы.Дефекты.Видимость = Объект.ТипПоказателя = 0;
	Элементы.ГруппаОтветственные.Видимость = Объект.ТипПоказателя = 0;

	
	Элементы.ГруппаПоказатели.Видимость = Объект.ТипПоказателя = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипПоказателя = 0 И НЕ ЗначениеЗаполнено(Объект.ВидПоказателя) Тогда
		Сообщить(НСтр("ru='Заполните вид показателя';en='Fill the kind of indicator'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	КоличествоПериодов = ТекущийОбъект.КоличествоЛет +
							ТекущийОбъект.КоличествоМесяцев +
							ТекущийОбъект.КоличествоНедель +
							ТекущийОбъект.КоличествоДней;
	
	Если  ТекущийОбъект.НомерКолонкиДляВыборкиТопДефектов > КоличествоПериодов Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Номер колонки не должен превышать сумму количества периодов'; en='The number of column should be more than amoun of periods'");
		Сообщение.Поле = "";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
